package lesson1.tasks

/**
 * Вам необходимо вывести в консоль столицы Казахстан за 20-й и 21-й век на каждой новой строке.
 *
 * Создайте Mutable Set - "Оренбург", "Кызыл-Орда", "Алма-Ата",  "Акмола"
 * Добавить туда "Astana".
 * Распечатать на каждой новой строке столицы.
 *
 * Sample Input:
 *
 * "Оренбург", "Кызыл-Орда", "Алма-Ата",  "Акмола"
 * Sample Output:
 *
 * [Оренбург, Кызыл-Орда, Алма-Ата, Акмола]
 * Оренбург
 * Кызыл-Орда
 * Алма-Ата
 * Акмола
 * Астана
 */
fun main() {

    var linkedHashSet = linkedSetOf<String>("Оренбург", "Кызыл-Орда", "Алма-Ата", "Акмола")

    println(linkedHashSet)

    linkedHashSet.add("Астана")

    for (i in linkedHashSet) {
        println(i)
    }
}